using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class GearRotate2 : MonoBehaviour
{
    //*** ==================
    //*** 非常に良いです。
    //*** ==================

    //*** ======================================================================================================================
    //*** [アドバイス] Vector(0, 0, 3)の 3 の部分をpublic変数にするとinspectorで値を変えれるのでGearRotate2が必要無くなります。
    //*** ======================================================================================================================

    void Update()
    {
        //z軸にー3回す
        transform.Rotate(new Vector3(0, 0, -3));
    }
}
